Revit 2027 API
HorizontalAlign Enumeration
Horizontal alignment of model text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum HorizontalAlign
Public Enumeration HorizontalAlign
public enum class HorizontalAlign
type HorizontalAlign
Members
Member name | Value | Description
Center | 128
Left | 64
Right | 256
See Also
Reference
Autodesk.Revit.DB Namespace